# PDF_PrintBlob

## Description
Prints a page from the PDF Blob

```pascal
FUNCTION PDF_PrintBlob(
				inBlobPtr  : PROCEDURE;
				inBlobSize : LONGINT;
				inSettings : PROCEDURE) : BOOLEAN;
```

```python

def vs.PDF_PrintBlob(inBlobPtr, inBlobSize, inSettings):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inBlobPtr|PROCEDURE||
|inBlobSize|LONGINT||
|inSettings|PROCEDURE||

## Version
Availability: from Vectorworks 2014
## Category
* PDF